; domain
(define (domain sokoban)
        (:requirements :strips)
        (:constants player box wall)
        (:predicates (at ?p ?x ?y)
                        (inc ?x ?nx)
                        (dec ?x ?nx)
                        (use_teleport)         
        )
        (:action move-player-right
                :parameters (?x ?y ?yn)
                :precondition (and (at player ?x ?y)
                                (not (at box ?x ?yn))
                                (not (at wall ?x ?yn))
                                (inc ?y ?yn)
                )
                :effect	        (and (at player ?x ?yn)
                                (not (at player ?x ?y)))
        )
        (:action move-player-left
                :parameters (?x ?y ?yn)
                :precondition (and (at player ?x ?y)
                                (not (at box ?x ?yn))
                                (not (at wall ?x ?yn))
                                (dec ?y ?yn)
                )
                :effect		(and (at player ?x ?yn)
                                (not (at player ?x ?y)))
        )
        (:action move-player-down
                :parameters (?x ?y ?xn)
                :precondition (and (at player ?x ?y)
                                (not (at box ?xn ?y))
                                (not (at wall ?xn ?y))
                                (inc ?x ?xn)
                )
                :effect		(and (at player ?xn ?y)
                                (not (at player ?x ?y)))
        )
        (:action move-player-up
                :parameters (?x ?y ?xn)
                :precondition (and (at player ?x ?y)
                                (not (at box ?xn ?y))
                                (not (at wall ?xn ?y))
                                (dec ?x ?xn)
                )
                :effect		(and (at player ?xn ?y)
                                (not (at player ?x ?y)))
        )
        (:action push-box-right
                :parameters (?x ?y ?yn ?ynn)
                :precondition (and (at player ?x ?y)
                                (at box ?x ?yn)
                                (not (at wall ?x ?yn))
                                (inc ?y ?yn)
                                (not (at box ?x ?ynn))
                                (not (at wall ?x ?ynn))
                                (inc ?yn ?ynn)
                )
                :effect		(and (at player ?x ?yn)
                                (at box ?x ?ynn)
                                (not (at player ?x ?y))
                                (not (at box ?x ?yn)))
        )
        (:action push-box-left
                :parameters (?x ?y ?yn ?ynn)
                :precondition (and (at player ?x ?y)
                                (at box ?x ?yn)
                                (not (at wall ?x ?yn))
                                (dec ?y ?yn)
                                (not (at box ?x ?ynn))
                                (not (at wall ?x ?ynn))
                                (dec ?yn ?ynn)
                )
                :effect		(and (at player ?x ?yn)
                                (at box ?x ?ynn)
                                (not (at player ?x ?y))
                                (not (at box ?x ?yn)))
        )
        (:action push-box-down
                :parameters (?x ?y ?xn ?xnn)
                :precondition (and (at player ?x ?y)
                                (at box ?xn ?y)
                                (not (at wall ?xn ?y))
                                (inc ?x ?xn)
                                (not (at box ?xnn ?y))
                                (not (at wall ?xnn ?y))
                                (inc ?xn ?xnn)
                )
                :effect		(and (at player ?xn ?y)
                                (at box ?xnn ?y)
                                (not (at player ?x ?y))
                                (not (at box ?xn ?y)))
        )
        (:action push-box-up
                :parameters (?x ?y ?xn ?xnn)
                :precondition (and (at player ?x ?y)
                                (at box ?xn ?y)
                                (not (at wall ?xn ?y))
                                (dec ?x ?xn)
                                (not (at box ?xnn ?y))
                                (not (at wall ?xnn ?y))
                                (dec ?xn ?xnn)
                )
                :effect		(and (at player ?xn ?y)
                                (at box ?xnn ?y)
                                (not (at player ?x ?y))
                                (not (at box ?xn ?y)))
        )
        (:action teleport
                :parameters (?x ?y ?xn ?yn)
                :precondition (and (at player ?x ?y)
                                (not (at box ?xn ?yn))
                                (not (at wall ?xn ?yn))
                                (use_teleport)
                )
                :effect         (and (at player ?xn ?yn)
                                (not (at player ?x ?y))
                                (not(use_teleport)))
                )
)

; problem
(define (problem sokobanlevel)
(:domain sokoban)
(:objects v0 v1 v2 v3 v4 v5 v6 v7 v8 v9 v10)
(:init (inc v0 v1) (dec v1 v0) 
(inc v1 v2) (dec v2 v1) 
(inc v2 v3) (dec v3 v2) 
(inc v3 v4) (dec v4 v3) 
(inc v4 v5) (dec v5 v4) 
(inc v5 v6) (dec v6 v5) 
(inc v6 v7) (dec v7 v6) 
(inc v7 v8) (dec v8 v7) 
(inc v8 v9) (dec v9 v8) 
(inc v9 v10) (dec v10 v9) 
(use_teleport)
(at player v4 v4)
(at box v4 v5) 
(at box v3 v3) 
(at box v5 v4) 
(at wall v4 v0) 
(at wall v3 v1) 
(at wall v3 v10) 
(at wall v5 v1) 
(at wall v5 v7) 
(at wall v5 v10) 
(at wall v8 v9) 
(at wall v10 v6) 
(at wall v9 v8) 
(at wall v0 v5) 
(at wall v2 v2) 
(at wall v10 v3) 
(at wall v2 v5) 
(at wall v1 v3) 
(at wall v1 v9) 
(at wall v7 v4) 
(at wall v6 v2) 
(at wall v7 v1) 
(at wall v7 v7) 
(at wall v6 v5) 
(at wall v7 v10) 
(at wall v3 v0) 
(at wall v5 v0) 
(at wall v5 v6) 
(at wall v9 v1) 
(at wall v9 v7) 
(at wall v10 v2) 
(at wall v8 v8) 
(at wall v10 v5) 
(at wall v1 v2) 
(at wall v0 v4) 
(at wall v2 v1) 
(at wall v2 v7) 
(at wall v1 v5) 
(at wall v2 v10) 
(at wall v1 v8) 
(at wall v7 v9) 
(at wall v6 v10) 
(at wall v4 v7) 
(at wall v5 v2) 
(at wall v4 v10) 
(at wall v5 v5) 
(at wall v8 v1) 
(at wall v10 v4) 
(at wall v0 v3) 
(at wall v10 v1) 
(at wall v10 v7) 
(at wall v1 v7) 
(at wall v2 v6) 
(at wall v1 v10) 
(at wall v7 v2) 
(at wall v7 v5) 
)
(:goal (and (at box v6 v6) 
(at box v6 v7) 
(at box v7 v6) 
)))

; plan
1. (move-player-up v4 v4 v3)
   deleted: (at player v4 v4)
   added: (at player v3 v4)
   goals met: 0 of 3
2. (move-player-up v3 v4 v2)
   deleted: (at player v3 v4)
   added: (at player v2 v4)
   goals met: 0 of 3
3. (move-player-left v2 v4 v3)
   deleted: (at player v2 v4)
   added: (at player v2 v3)
   goals met: 0 of 3
4. (push-box-down v2 v3 v3 v4)
   deleted: (at player v2 v3) (at box v3 v3)
   added: (at player v3 v3) (at box v4 v3)
   goals met: 0 of 3
5. (push-box-down v3 v3 v4 v5)
   deleted: (at player v3 v3) (at box v4 v3)
   added: (at player v4 v3) (at box v5 v3)
   goals met: 0 of 3
6. (push-box-down v4 v3 v5 v6)
   deleted: (at player v4 v3) (at box v5 v3)
   added: (at player v5 v3) (at box v6 v3)
   goals met: 0 of 3
7. (push-box-down v5 v3 v6 v7)
   deleted: (at player v5 v3) (at box v6 v3)
   added: (at player v6 v3) (at box v7 v3)
   goals met: 0 of 3
8. (push-box-down v6 v3 v7 v8)
   deleted: (at player v6 v3) (at box v7 v3)
   added: (at player v7 v3) (at box v8 v3)
   goals met: 0 of 3
9. (move-player-up v7 v3 v6)
   deleted: (at player v7 v3)
   added: (at player v6 v3)
   goals met: 0 of 3
10. (move-player-up v6 v3 v5)
   deleted: (at player v6 v3)
   added: (at player v5 v3)
   goals met: 0 of 3
11. (move-player-up v5 v3 v4)
   deleted: (at player v5 v3)
   added: (at player v4 v3)
   goals met: 0 of 3
12. (move-player-right v4 v3 v4)
   deleted: (at player v4 v3)
   added: (at player v4 v4)
   goals met: 0 of 3
13. (move-player-up v4 v4 v3)
   deleted: (at player v4 v4)
   added: (at player v3 v4)
   goals met: 0 of 3
14. (move-player-right v3 v4 v5)
   deleted: (at player v3 v4)
   added: (at player v3 v5)
   goals met: 0 of 3
15. (move-player-right v3 v5 v6)
   deleted: (at player v3 v5)
   added: (at player v3 v6)
   goals met: 0 of 3
16. (move-player-right v3 v6 v7)
   deleted: (at player v3 v6)
   added: (at player v3 v7)
   goals met: 0 of 3
17. (move-player-right v3 v7 v8)
   deleted: (at player v3 v7)
   added: (at player v3 v8)
   goals met: 0 of 3
18. (move-player-down v3 v8 v4)
   deleted: (at player v3 v8)
   added: (at player v4 v8)
   goals met: 0 of 3
19. (move-player-down v4 v8 v5)
   deleted: (at player v4 v8)
   added: (at player v5 v8)
   goals met: 0 of 3
20. (move-player-down v5 v8 v6)
   deleted: (at player v5 v8)
   added: (at player v6 v8)
   goals met: 0 of 3
21. (move-player-left v6 v8 v7)
   deleted: (at player v6 v8)
   added: (at player v6 v7)
   goals met: 0 of 3
22. (move-player-left v6 v7 v6)
   deleted: (at player v6 v7)
   added: (at player v6 v6)
   goals met: 0 of 3
23. (move-player-down v6 v6 v7)
   deleted: (at player v6 v6)
   added: (at player v7 v6)
   goals met: 0 of 3
24. (move-player-down v7 v6 v8)
   deleted: (at player v7 v6)
   added: (at player v8 v6)
   goals met: 0 of 3
25. (move-player-left v8 v6 v5)
   deleted: (at player v8 v6)
   added: (at player v8 v5)
   goals met: 0 of 3
26. (move-player-down v8 v5 v9)
   deleted: (at player v8 v5)
   added: (at player v9 v5)
   goals met: 0 of 3
27. (move-player-left v9 v5 v4)
   deleted: (at player v9 v5)
   added: (at player v9 v4)
   goals met: 0 of 3
28. (move-player-left v9 v4 v3)
   deleted: (at player v9 v4)
   added: (at player v9 v3)
   goals met: 0 of 3
29. (move-player-left v9 v3 v2)
   deleted: (at player v9 v3)
   added: (at player v9 v2)
   goals met: 0 of 3
30. (move-player-up v9 v2 v8)
   deleted: (at player v9 v2)
   added: (at player v8 v2)
   goals met: 0 of 3
31. (push-box-right v8 v2 v3 v4)
   deleted: (at player v8 v2) (at box v8 v3)
   added: (at player v8 v3) (at box v8 v4)
   goals met: 0 of 3
32. (move-player-up v8 v3 v7)
   deleted: (at player v8 v3)
   added: (at player v7 v3)
   goals met: 0 of 3
33. (move-player-up v7 v3 v6)
   deleted: (at player v7 v3)
   added: (at player v6 v3)
   goals met: 0 of 3
34. (move-player-right v6 v3 v4)
   deleted: (at player v6 v3)
   added: (at player v6 v4)
   goals met: 0 of 3
35. (push-box-up v6 v4 v5 v4)
   deleted: (at player v6 v4) (at box v5 v4)
   added: (at player v5 v4) (at box v4 v4)
   goals met: 0 of 3
36. (push-box-up v5 v4 v4 v3)
   deleted: (at player v5 v4) (at box v4 v4)
   added: (at player v4 v4) (at box v3 v4)
   goals met: 0 of 3
37. (move-player-left v4 v4 v3)
   deleted: (at player v4 v4)
   added: (at player v4 v3)
   goals met: 0 of 3
38. (move-player-up v4 v3 v3)
   deleted: (at player v4 v3)
   added: (at player v3 v3)
   goals met: 0 of 3
39. (push-box-right v3 v3 v4 v5)
   deleted: (at player v3 v3) (at box v3 v4)
   added: (at player v3 v4) (at box v3 v5)
   goals met: 0 of 3
40. (push-box-right v3 v4 v5 v6)
   deleted: (at player v3 v4) (at box v3 v5)
   added: (at player v3 v5) (at box v3 v6)
   goals met: 0 of 3
41. (push-box-right v3 v5 v6 v7)
   deleted: (at player v3 v5) (at box v3 v6)
   added: (at player v3 v6) (at box v3 v7)
   goals met: 0 of 3
42. (push-box-right v3 v6 v7 v8)
   deleted: (at player v3 v6) (at box v3 v7)
   added: (at player v3 v7) (at box v3 v8)
   goals met: 0 of 3
43. (move-player-left v3 v7 v6)
   deleted: (at player v3 v7)
   added: (at player v3 v6)
   goals met: 0 of 3
44. (move-player-down v3 v6 v4)
   deleted: (at player v3 v6)
   added: (at player v4 v6)
   goals met: 0 of 3
45. (push-box-left v4 v6 v5 v4)
   deleted: (at player v4 v6) (at box v4 v5)
   added: (at player v4 v5) (at box v4 v4)
   goals met: 0 of 3
46. (push-box-left v4 v5 v4 v3)
   deleted: (at player v4 v5) (at box v4 v4)
   added: (at player v4 v4) (at box v4 v3)
   goals met: 0 of 3
47. (move-player-down v4 v4 v5)
   deleted: (at player v4 v4)
   added: (at player v5 v4)
   goals met: 0 of 3
48. (move-player-down v5 v4 v6)
   deleted: (at player v5 v4)
   added: (at player v6 v4)
   goals met: 0 of 3
49. (move-player-left v6 v4 v3)
   deleted: (at player v6 v4)
   added: (at player v6 v3)
   goals met: 0 of 3
50. (move-player-down v6 v3 v7)
   deleted: (at player v6 v3)
   added: (at player v7 v3)
   goals met: 0 of 3
51. (move-player-down v7 v3 v8)
   deleted: (at player v7 v3)
   added: (at player v8 v3)
   goals met: 0 of 3
52. (push-box-right v8 v3 v4 v5)
   deleted: (at player v8 v3) (at box v8 v4)
   added: (at player v8 v4) (at box v8 v5)
   goals met: 0 of 3
53. (move-player-down v8 v4 v9)
   deleted: (at player v8 v4)
   added: (at player v9 v4)
   goals met: 0 of 3
54. (move-player-right v9 v4 v5)
   deleted: (at player v9 v4)
   added: (at player v9 v5)
   goals met: 0 of 3
55. (move-player-right v9 v5 v6)
   deleted: (at player v9 v5)
   added: (at player v9 v6)
   goals met: 0 of 3
56. (move-player-up v9 v6 v8)
   deleted: (at player v9 v6)
   added: (at player v8 v6)
   goals met: 0 of 3
57. (move-player-up v8 v6 v7)
   deleted: (at player v8 v6)
   added: (at player v7 v6)
   goals met: 0 of 3
58. (move-player-up v7 v6 v6)
   deleted: (at player v7 v6)
   added: (at player v6 v6)
   goals met: 0 of 3
59. (move-player-right v6 v6 v7)
   deleted: (at player v6 v6)
   added: (at player v6 v7)
   goals met: 0 of 3
60. (move-player-right v6 v7 v8)
   deleted: (at player v6 v7)
   added: (at player v6 v8)
   goals met: 0 of 3
61. (move-player-up v6 v8 v5)
   deleted: (at player v6 v8)
   added: (at player v5 v8)
   goals met: 0 of 3
62. (move-player-up v5 v8 v4)
   deleted: (at player v5 v8)
   added: (at player v4 v8)
   goals met: 0 of 3
63. (move-player-right v4 v8 v9)
   deleted: (at player v4 v8)
   added: (at player v4 v9)
   goals met: 0 of 3
64. (move-player-up v4 v9 v3)
   deleted: (at player v4 v9)
   added: (at player v3 v9)
   goals met: 0 of 3
65. (move-player-up v3 v9 v2)
   deleted: (at player v3 v9)
   added: (at player v2 v9)
   goals met: 0 of 3
66. (move-player-left v2 v9 v8)
   deleted: (at player v2 v9)
   added: (at player v2 v8)
   goals met: 0 of 3
67. (push-box-down v2 v8 v3 v4)
   deleted: (at player v2 v8) (at box v3 v8)
   added: (at player v3 v8) (at box v4 v8)
   goals met: 0 of 3
68. (move-player-left v3 v8 v7)
   deleted: (at player v3 v8)
   added: (at player v3 v7)
   goals met: 0 of 3
69. (move-player-left v3 v7 v6)
   deleted: (at player v3 v7)
   added: (at player v3 v6)
   goals met: 0 of 3
70. (move-player-left v3 v6 v5)
   deleted: (at player v3 v6)
   added: (at player v3 v5)
   goals met: 0 of 3
71. (move-player-left v3 v5 v4)
   deleted: (at player v3 v5)
   added: (at player v3 v4)
   goals met: 0 of 3
72. (move-player-left v3 v4 v3)
   deleted: (at player v3 v4)
   added: (at player v3 v3)
   goals met: 0 of 3
73. (push-box-down v3 v3 v4 v5)
   deleted: (at player v3 v3) (at box v4 v3)
   added: (at player v4 v3) (at box v5 v3)
   goals met: 0 of 3
74. (push-box-down v4 v3 v5 v6)
   deleted: (at player v4 v3) (at box v5 v3)
   added: (at player v5 v3) (at box v6 v3)
   goals met: 0 of 3
75. (push-box-down v5 v3 v6 v7)
   deleted: (at player v5 v3) (at box v6 v3)
   added: (at player v6 v3) (at box v7 v3)
   goals met: 0 of 3
76. (push-box-down v6 v3 v7 v8)
   deleted: (at player v6 v3) (at box v7 v3)
   added: (at player v7 v3) (at box v8 v3)
   goals met: 0 of 3
77. (move-player-up v7 v3 v6)
   deleted: (at player v7 v3)
   added: (at player v6 v3)
   goals met: 0 of 3
78. (move-player-right v6 v3 v4)
   deleted: (at player v6 v3)
   added: (at player v6 v4)
   goals met: 0 of 3
79. (move-player-up v6 v4 v5)
   deleted: (at player v6 v4)
   added: (at player v5 v4)
   goals met: 0 of 3
80. (move-player-up v5 v4 v4)
   deleted: (at player v5 v4)
   added: (at player v4 v4)
   goals met: 0 of 3
81. (move-player-right v4 v4 v5)
   deleted: (at player v4 v4)
   added: (at player v4 v5)
   goals met: 0 of 3
82. (move-player-right v4 v5 v6)
   deleted: (at player v4 v5)
   added: (at player v4 v6)
   goals met: 0 of 3
83. (move-player-up v4 v6 v3)
   deleted: (at player v4 v6)
   added: (at player v3 v6)
   goals met: 0 of 3
84. (move-player-right v3 v6 v7)
   deleted: (at player v3 v6)
   added: (at player v3 v7)
   goals met: 0 of 3
85. (move-player-right v3 v7 v8)
   deleted: (at player v3 v7)
   added: (at player v3 v8)
   goals met: 0 of 3
86. (push-box-down v3 v8 v4 v5)
   deleted: (at player v3 v8) (at box v4 v8)
   added: (at player v4 v8) (at box v5 v8)
   goals met: 0 of 3
87. (move-player-right v4 v8 v9)
   deleted: (at player v4 v8)
   added: (at player v4 v9)
   goals met: 0 of 3
88. (move-player-down v4 v9 v5)
   deleted: (at player v4 v9)
   added: (at player v5 v9)
   goals met: 0 of 3
89. (move-player-down v5 v9 v6)
   deleted: (at player v5 v9)
   added: (at player v6 v9)
   goals met: 0 of 3
90. (move-player-left v6 v9 v8)
   deleted: (at player v6 v9)
   added: (at player v6 v8)
   goals met: 0 of 3
91. (move-player-left v6 v8 v7)
   deleted: (at player v6 v8)
   added: (at player v6 v7)
   goals met: 0 of 3
92. (move-player-left v6 v7 v6)
   deleted: (at player v6 v7)
   added: (at player v6 v6)
   goals met: 0 of 3
93. (move-player-down v6 v6 v7)
   deleted: (at player v6 v6)
   added: (at player v7 v6)
   goals met: 0 of 3
94. (move-player-down v7 v6 v8)
   deleted: (at player v7 v6)
   added: (at player v8 v6)
   goals met: 0 of 3
95. (move-player-down v8 v6 v9)
   deleted: (at player v8 v6)
   added: (at player v9 v6)
   goals met: 0 of 3
96. (move-player-left v9 v6 v5)
   deleted: (at player v9 v6)
   added: (at player v9 v5)
   goals met: 0 of 3
97. (move-player-left v9 v5 v4)
   deleted: (at player v9 v5)
   added: (at player v9 v4)
   goals met: 0 of 3
98. (move-player-up v9 v4 v8)
   deleted: (at player v9 v4)
   added: (at player v8 v4)
   goals met: 0 of 3
99. (push-box-right v8 v4 v5 v6)
   deleted: (at player v8 v4) (at box v8 v5)
   added: (at player v8 v5) (at box v8 v6)
   goals met: 0 of 3
100. (move-player-down v8 v5 v9)
   deleted: (at player v8 v5)
   added: (at player v9 v5)
   goals met: 0 of 3
101. (move-player-right v9 v5 v6)
   deleted: (at player v9 v5)
   added: (at player v9 v6)
   goals met: 0 of 3
102. (push-box-up v9 v6 v8 v7)
   deleted: (at player v9 v6) (at box v8 v6)
   added: (at player v8 v6) (at box v7 v6)
   goals met: 1 of 3
103. (push-box-up v8 v6 v7 v6)
   deleted: (at player v8 v6) (at box v7 v6)
   added: (at player v7 v6) (at box v6 v6)
   goals met: 1 of 3
104. (move-player-down v7 v6 v8)
   deleted: (at player v7 v6)
   added: (at player v8 v6)
   goals met: 1 of 3
105. (move-player-down v8 v6 v9)
   deleted: (at player v8 v6)
   added: (at player v9 v6)
   goals met: 1 of 3
106. (move-player-left v9 v6 v5)
   deleted: (at player v9 v6)
   added: (at player v9 v5)
   goals met: 1 of 3
107. (move-player-left v9 v5 v4)
   deleted: (at player v9 v5)
   added: (at player v9 v4)
   goals met: 1 of 3
108. (move-player-left v9 v4 v3)
   deleted: (at player v9 v4)
   added: (at player v9 v3)
   goals met: 1 of 3
109. (move-player-left v9 v3 v2)
   deleted: (at player v9 v3)
   added: (at player v9 v2)
   goals met: 1 of 3
110. (move-player-up v9 v2 v8)
   deleted: (at player v9 v2)
   added: (at player v8 v2)
   goals met: 1 of 3
111. (push-box-right v8 v2 v3 v4)
   deleted: (at player v8 v2) (at box v8 v3)
   added: (at player v8 v3) (at box v8 v4)
   goals met: 1 of 3
112. (push-box-right v8 v3 v4 v5)
   deleted: (at player v8 v3) (at box v8 v4)
   added: (at player v8 v4) (at box v8 v5)
   goals met: 1 of 3
113. (push-box-right v8 v4 v5 v6)
   deleted: (at player v8 v4) (at box v8 v5)
   added: (at player v8 v5) (at box v8 v6)
   goals met: 1 of 3
114. (move-player-down v8 v5 v9)
   deleted: (at player v8 v5)
   added: (at player v9 v5)
   goals met: 1 of 3
115. (move-player-right v9 v5 v6)
   deleted: (at player v9 v5)
   added: (at player v9 v6)
   goals met: 1 of 3
116. (push-box-up v9 v6 v8 v7)
   deleted: (at player v9 v6) (at box v8 v6)
   added: (at player v8 v6) (at box v7 v6)
   goals met: 2 of 3
117. (move-player-left v8 v6 v5)
   deleted: (at player v8 v6)
   added: (at player v8 v5)
   goals met: 2 of 3
118. (move-player-left v8 v5 v4)
   deleted: (at player v8 v5)
   added: (at player v8 v4)
   goals met: 2 of 3
119. (move-player-left v8 v4 v3)
   deleted: (at player v8 v4)
   added: (at player v8 v3)
   goals met: 2 of 3
120. (move-player-up v8 v3 v7)
   deleted: (at player v8 v3)
   added: (at player v7 v3)
   goals met: 2 of 3
121. (move-player-up v7 v3 v6)
   deleted: (at player v7 v3)
   added: (at player v6 v3)
   goals met: 2 of 3
122. (move-player-up v6 v3 v5)
   deleted: (at player v6 v3)
   added: (at player v5 v3)
   goals met: 2 of 3
123. (move-player-right v5 v3 v4)
   deleted: (at player v5 v3)
   added: (at player v5 v4)
   goals met: 2 of 3
124. (move-player-up v5 v4 v4)
   deleted: (at player v5 v4)
   added: (at player v4 v4)
   goals met: 2 of 3
125. (move-player-right v4 v4 v5)
   deleted: (at player v4 v4)
   added: (at player v4 v5)
   goals met: 2 of 3
126. (move-player-right v4 v5 v6)
   deleted: (at player v4 v5)
   added: (at player v4 v6)
   goals met: 2 of 3
127. (move-player-up v4 v6 v3)
   deleted: (at player v4 v6)
   added: (at player v3 v6)
   goals met: 2 of 3
128. (move-player-right v3 v6 v7)
   deleted: (at player v3 v6)
   added: (at player v3 v7)
   goals met: 2 of 3
129. (move-player-right v3 v7 v8)
   deleted: (at player v3 v7)
   added: (at player v3 v8)
   goals met: 2 of 3
130. (move-player-down v3 v8 v4)
   deleted: (at player v3 v8)
   added: (at player v4 v8)
   goals met: 2 of 3
131. (push-box-down v4 v8 v5 v6)
   deleted: (at player v4 v8) (at box v5 v8)
   added: (at player v5 v8) (at box v6 v8)
   goals met: 2 of 3
132. (move-player-right v5 v8 v9)
   deleted: (at player v5 v8)
   added: (at player v5 v9)
   goals met: 2 of 3
133. (move-player-down v5 v9 v6)
   deleted: (at player v5 v9)
   added: (at player v6 v9)
   goals met: 2 of 3
134. (push-box-left v6 v9 v8 v7)
   deleted: (at player v6 v9) (at box v6 v8)
   added: (at player v6 v8) (at box v6 v7)
   goals met: 3 of 3
